all_591_cities = [
    {
        "city": "台北市",
        "id": "1"
    },
    {
        "city": "新北市",
        "id": "3"
    },
    {
        "city": "桃園市",
        "id": "6"
    },
    {
        "city": "新竹市",
        "id": "4"
    },
    {
        "city": "新竹縣",
        "id": "5"
    },
    {
        "city": "基隆市",
        "id": "2"
    },
    {
        "city": "宜蘭縣",
        "id": "21"
    },
    {
        "city": "台中市",
        "id": "8"
    },
    {
        "city": "彰化縣",
        "id": "10"
    },
    {
        "city": "苗栗縣",
        "id": "7"
    },
    {
        "city": "雲林縣",
        "id": "14"
    },
    {
        "city": "南投縣",
        "id": "11"
    },
    {
        "city": "高雄市",
        "id": "17"
    },
    {
        "city": "台南市",
        "id": "15"
    },
    {
        "city": "嘉義市",
        "id": "12"
    },
    {
        "city": "屏東縣",
        "id": "19"
    },
    {
        "city": "嘉義縣",
        "id": "13"
    },
    {
        "city": "花蓮縣",
        "id": "23"
    },
    {
        "city": "台東縣",
        "id": "22"
    },
    {
        "city": "金門縣",
        "id": "25"
    },
    {
        "city": "澎湖縣",
        "id": "24"
    }
]
